max-bot-cf/Catalogs/энргАбоненты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргАбоненты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агентский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Домовладение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МуниципальноеОбразование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМуниципальноеОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеОтметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВнутрРайон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГород</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаПрописки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговорАбонента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыАбонентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКвартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьМКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНасПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкруг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРайонАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУлица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPабонент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчетЕИРЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

max-bot-cf/CommonModules/энргПользовательскийВводКлиент/Ext/Module.bsl
#Область ОбработчикиСобытий
 
Процедура ПроверитьГраницыПериода(ДатаС, ДатаПо) экспорт
	Если не ЗначениеЗаполнено(ДатаПо) и ДатаПо<ДатаС тогда
		Врем=ДатаС;  ДатаС=ДатаПо;  ДатаПо=Врем;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьГраницыПериодаЗаМесяц(ДатаС, ДатаПо, ДатаОснование) экспорт
	ГлавнаяДата = ДобавитьМесяц(ДатаОснование, -1);
	ДатаС = НачалоМесяца(ГлавнаяДата);
	ДатаПо = КонецМесяца(ГлавнаяДата);
КонецПроцедуры

Процедура УстановитьПериод(НачалоПериода, КонецПериода) экспорт
	// ДиалогПериода = Новый НастройкаПериода();
	// ДиалогПериода.УстановитьПериод(НачалоПериода, КонецПериода);
	// Если ДиалогПериода.Редактировать() тогда
	//	НачалоПериода = ДиалогПериода.ПолучитьДатуНачала();
	//	КонецПериода = ДиалогПериода.ПолучитьДатуОкончания();
	// КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьСписокВыбораРайона(ЭлементФормы,ЗаполнятьРайон = ложь) Экспорт	
	СписокРайонов 				= энргОбщегоНазначенияСерверПовтИспол.СписокРайонов(); 
	ЭлементФормы.СписокВыбора = СписокРайонов;
	Если СписокРайонов.количество() = 1 тогда
		Если ЗаполнятьРайон тогда
			ЭлементФормы.Значение  = СписокРайонов[0].Значение;
			ЭлементФормы.толькоПросмотр= истина;
		КонецЕсли;
	КонецЕсли;	
КонецФункции

Процедура ПриИзмененииАбонента(Форма, ДопСвойства = Неопределено) Экспорт 
	
	Объект 					= Форма.Объект;
	ДанныеАбонента  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
	Если ЗначениеЗаполнено(ДопСвойства) Тогда
		Для каждого ДопСв Из ДопСвойства Цикл
			ДанныеАбонента.Вставить(ДопСв);
		КонецЦикла;
	КонецЕсли;

	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Объект.Абонент,ДанныеАбонента);
	
	ДанныеАбонента.удалить("Абонент");
	Если Объект.свойство("ПериодНачисления") тогда
		ДанныеАбонента.вставить("ПериодНачисления",Объект.ПериодНачисления);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект,ДанныеАбонента);
	ЗаполнитьЗначенияСвойств(Форма,ДанныеАбонента);
	
КонецПроцедуры

Процедура ПриИзмененииАбонентаВТабличнойЧасти(ТекущиеДанныеСтрокиТабЧасти) Экспорт 

	ДанныеАбонента  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияАбонента();
	ДанныеАбонента.удалить("Абонент");
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(ТекущиеДанныеСтрокиТабЧасти.Абонент,ДанныеАбонента);
	ЗаполнитьЗначенияСвойств(ТекущиеДанныеСтрокиТабЧасти,ДанныеАбонента);
		
КонецПроцедуры

Процедура ПриИзмененииСтроенияПомещения(Форма, ПерезаполнятьРайон = Истина, ПерезаполнятьАбонента = Истина, ЗаполнитьКоличествоЖильцов = Ложь) Экспорт  
	Объект 					= Форма.Объект;
	Строение 				= Форма.Строение;
	Помещение 				= Форма.Помещение;
	ДанныеСтроения			= энргПользовательскийВводСервер.ПрочитатьКлючПомещения(Строение,Помещение);
	Объект.КлючПомещения	= ДанныеСтроения.КлючПомещения;
	Если НЕ Объект.Район = ДанныеСтроения.Район и ПерезаполнятьРайон Тогда
		Объект.Район 		= ДанныеСтроения.Район;
	КонецЕсли;
	
	РеквизитАбонентСуществует = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Абонент");	
	Если РеквизитАбонентСуществует и ПерезаполнятьАбонента Тогда 
		Абонент = энргПользовательскийВводСервер.ПрочитатьАбонентаПомещения(Объект.КлючПомещения, ДанныеСтроения.Район, Объект.Организация, Объект.Дата);
		Объект.Абонент = Абонент;
	КонецЕсли;  	
	
	Если РеквизитАбонентСуществует и ЗаполнитьКоличествоЖильцов Тогда
		Если Не ЗначениеЗаполнено(Объект.Абонент) И ЗначениеЗаполнено(Объект.КлючПомещения) Тогда
			Объект.КоличествоЖильцов = энргПользовательскийВводСервер.ПрочитатьКоличествоЖильцовПомещения(Строение, Помещение, ДанныеСтроения.ЧастныйСектор, Объект.Организация, Объект.Район, Объект.ПериодНачисления);	
		КонецЕсли;
	КонецЕсли;
	
	ДанныеДаполнения  		= Новый Структура("ЧастныйСектор", ДанныеСтроения.ЧастныйСектор);
	ЗаполнитьЗначенияСвойств(Форма, ДанныеДаполнения);
		
КонецПроцедуры

Процедура ПриИзмененииМКД(Объект) Экспорт 
	  ДанныеМКД  		= энргРаботаСЛицевымСчетомКлиент.СтруктруаЗначенийЗаполненияМКД();
	  Если Объект.свойство("ПериодНачисления") тогда
		  ДанныеМКД.вставить("ПериодНачисления",Объект.ПериодНачисления);
	  КонецЕсли;
	  энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыМКД(Объект.МКД,ДанныеМКД);
	  ЗаполнитьЗначенияСвойств(Объект,ДанныеМКД);

КонецПроцедуры

Процедура НачалоВыбораАбонента(Элемент,Организация,Район,Дом,СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт 
	СтандартнаяОбработка 	= ложь;	
	Отбор					= Новый Структура();
	ПараметрыВыбора  		= Новый Структура;
	Если ЗначениеЗаполнено(Организация) тогда
		Отбор.Вставить("Организация",Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Район) тогда
		Отбор.Вставить("Район",Район);
	КонецЕсли;
	Если ЗначениеЗаполнено(Дом) тогда
		Отбор.Вставить("Дом",Дом);
	КонецЕсли; 
	
	// ОТЭК, 21.05.2020, 000202897.
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		Если ДополнительныеПараметры.Свойство("Строение") Тогда
			Отбор.Вставить("Строение", ДополнительныеПараметры.Строение);	
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыВыбора.Вставить("Отбор",Отбор);
	ОткрытьФорму("Справочник.энргАбоненты.ФормаВыбора",ПараметрыВыбора,Элемент);
КонецПроцедуры

Процедура НачалоВыбораТочкиУчета(Элемент, ДополнительныеПараметры) Экспорт  
	ПараметрыВыбора 		= Новый Массив();
	Для Каждого КлючЗначение Из ДополнительныеПараметры Цикл
		Параметр 			= Новый ПараметрВыбора("Дополнительно." + КлючЗначение.Ключ, КлючЗначение.Значение);
		ПараметрыВыбора.Добавить(Параметр);
	КонецЦикла; 	
	мПараметры 				= Новый ФиксированныйМассив(ПараметрыВыбора);	
	Элемент.ПараметрыВыбора = мПараметры;	
КонецПроцедуры

Процедура СкрытьПоказатьПанельПоиска(Элементы, ИмяГруппыПоиска, ИмяКнопки) Экспорт
	Видимость 							= Элементы[ИмяГруппыПоиска].Видимость;
	Элементы[ИмяГруппыПоиска].Видимость = не Видимость;
	Элементы[ИмяКнопки].Заголовок = ?(не Видимость,"Скрыть панель поиска","Открыть панель поиска");	
КонецПроцедуры

Процедура УдалитьЗависимыеСтроки(IDСтроки, Объект, ТаблицыФормы, ПостФиксКолонки = "", ТаблицыВторогоУровня = Неопределено, ПостФиксКолонкиВторогоУровня = "") Экспорт 
	СтруктураПоиска  				= Новый Структура("IDСтроки" + ПостФиксКолонки,IDСтроки);
	Для Каждого ТаблицаФормы из ТаблицыФормы цикл
		Коллекция  					= Объект[ТаблицаФормы];
		Строки  					= Коллекция.НайтиСтроки(СтруктураПоиска);	
		Для Каждого УдаляемаяСтрока из Строки Цикл 
			Если ТаблицыВторогоУровня <> Неопределено Тогда 
				СтруктураПоиска2  				= Новый Структура("IDСтроки" + ПостФиксКолонкиВторогоУровня, УдаляемаяСтрока.IDСтроки);
				Для Каждого ТаблицаФормы2 Из ТаблицыВторогоУровня Цикл
					Коллекция2  				= Объект[ТаблицаФормы2];
					Строки2  					= Коллекция2.НайтиСтроки(СтруктураПоиска2);	
					Для Каждого УдаляемаяСтрока2 из Строки2 Цикл 
						Коллекция2.Удалить(УдаляемаяСтрока2);
					КонецЦикла;
				КонецЦикла;			
			КонецЕсли;
			
			Коллекция.Удалить(УдаляемаяСтрока);
		КонецЦикла; 
	КонецЦикла;  
	
КонецПроцедуры

// ОТЭК, 21.05.2020, 000202897.
Процедура отэкНачалоВыбораСтроения(Элемент, Организация = Неопределено, Район = Неопределено, 
										СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	СтандартнаяОбработка 	= Ложь;	
	Отбор					= Новый Структура;
	ПараметрыВыбора  		= Новый Структура;
	
	Если ЗначениеЗаполнено(Организация) тогда
		Отбор.Вставить("Организация",Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Район) тогда
		Отбор.Вставить("Район",Район);
	КонецЕсли;
	  	 
	ПараметрыВыбора.Вставить("Отбор",Отбор);
	ОткрытьФорму("Справочник.энргСтроения.ФормаВыбора",ПараметрыВыбора,Элемент,,,,,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Процедура отэкНачалоВыбораЖильца(Элемент, ЮрФизЛицо = Неопределено, 
									СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	СтандартнаяОбработка = Ложь;
	Отбор					= Новый Структура;
	ПараметрыВыбора  		= Новый Структура("Отбор", Отбор);

	Если ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		Отбор.Вставить("ЮрФизЛицо", ЮрФизЛицо);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.энргКонтрагенты.ФормаВыбора", ПараметрыВыбора, Элемент,,,,, 
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#КонецОбласти

#Область РаботаСФормой

Процедура АктивизироватьНачальнуюСтрокуТочекУчета(Объект, ЭлементыФормы, ПрефиксТочекУчета) Экспорт
	
	Если Объект.ТочкиУчета.Количество() > 0 Тогда
		ЭлементФормы = ЭлементыФормы.Найти("ТочкиУчета" + ПрефиксТочекУчета);
		Если НЕ ЭлементФормы = Неопределено Тогда
			ЭлементФормы.ТекущаяСтрока = Объект.ТочкиУчета[0].ПолучитьИдентификатор();
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
